tap "dopplerhq/cli"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "railwayapp/railway"
tap "railwayapp/tap"
tap "supabase/tap"
tap "vitorgalvao/tiny-scripts"
brew "act"
brew "arduino-cli"
brew "autoconf"
brew "boost"
brew "libffi"
brew "pkg-config"
brew "sqlite"
brew "python@3.9"
brew "ccache"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "cog"
brew "cookiecutter"
brew "dfu-util"
brew "poppler"
brew "diff-pdf"
brew "esptool"
brew "exiftool"
brew "harfbuzz"
brew "ffmpeg"
brew "flyctl"
brew "gh"
brew "ghcup"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "jpeg", link: true
brew "graphviz"
brew "haskell-stack"
brew "huggingface-cli"
brew "hwloc"
brew "ios-deploy"
brew "ipfs"
brew "ipython"
brew "jq"
brew "libxml2"
brew "libxslt"
brew "make"
brew "mas"
brew "mysql"
brew "ninja"
brew "nmap"
brew "node"
brew "node@16"
brew "node@18"
brew "openapi-generator"
brew "protobuf"
brew "opencv"
brew "pdftk-java"
brew "tcl-tk"
brew "poetry"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-tk@3.9"
brew "python@3.10"
brew "qpdf"
brew "qt"
brew "railway"
brew "react-native-cli"
brew "rust"
brew "rustup-init"
brew "solidity"
brew "tig"
brew "tree"
brew "vcpkg"
brew "vim"
brew "watchman"
brew "wget"
brew "wxpython"
brew "yarn"
brew "railwayapp/tap/nixpacks"
brew "supabase/tap/supabase"
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "1password"
cask "adobe-digital-editions"
cask "adoptopenjdk"
cask "anaconda"
cask "arduino"
cask "arq"
cask "blockblock"
cask "chromium"
cask "cloudflare-warp"
cask "dhs"
cask "disk-drill"
cask "do-not-disturb"
cask "docker"
cask "duet"
cask "gnucash"
cask "google-drive"
cask "ipfs"
cask "karabiner-elements"
cask "kextviewr"
cask "linear-linear"
cask "logitech-unifying"
cask "mactex"
cask "mullvadvpn"
cask "ngrok"
cask "oversight"
cask "pycharm-ce"
cask "r"
cask "ransomwhere"
cask "reikey"
cask "rstudio"
cask "steam"
cask "sublime-text"
cask "vagrant"
cask "virtualbox-beta"
cask "vlc"
cask "wireshark"
cask "zoom"
mas "Be Focused Pro", id: 961632517
mas "BlueSee", id: 1336679524
mas "Brother iPrint&Scan", id: 1193539993
mas "Daily", id: 686910553
mas "GoodNotes", id: 1444383602
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LG Screen Manager", id: 1142051783
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "MKV2MP4", id: 585396074
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ScreenBrush", id: 1233965871
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835
vscode "arcanis.vscode-zipfs"
vscode "berublan.vscode-log-viewer"
vscode "BIGMOON.language-yesod"
vscode "cssho.vscode-svgviewer"
vscode "cstrachan.vcard"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "emilast.LogFileHighlighter"
vscode "esbenp.prettier-vscode"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hbenl.vscode-test-explorer"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "justusadam.language-haskell"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "NomicFoundation.hardhat-solidity"
vscode "pepri.subtitles-editor"
vscode "REditorSupport.r"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tintinweb.solidity-visual-auditor"
vscode "tintinweb.vscode-ethover"
vscode "tintinweb.vscode-inline-bookmarks"
vscode "tintinweb.vscode-solidity-language"
vscode "trond-snekvik.simple-rst"
