tap "dopplerhq/cli"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "vitorgalvao/tiny-scripts"
brew "jpeg"
brew "arduino-cli"
brew "autoconf"
brew "boost"
brew "libffi"
brew "python@3.9"
brew "pkg-config"
brew "ccache"
brew "cloc"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "dfu-util"
brew "poppler"
brew "diff-pdf"
brew "docker-compose"
brew "python@3.10"
brew "esptool"
brew "exiftool"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "graphviz"
brew "hwloc"
brew "ios-deploy"
brew "ipfs"
brew "ipython"
brew "jq"
brew "libxml2"
brew "libxslt"
brew "make"
brew "mas"
brew "mysql"
brew "ninja"
brew "nmap"
brew "node"
brew "node@16"
brew "openapi-generator"
brew "pdftk-java"
brew "tcl-tk"
brew "poetry"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-tk@3.9"
brew "qpdf"
brew "react-native-cli"
brew "rustup-init"
brew "solidity"
brew "tig"
brew "tree"
brew "vcpkg"
brew "vim"
brew "watchman"
brew "wget"
brew "wxpython"
brew "yarn"
brew "dopplerhq/cli/doppler"
brew "heroku/brew/heroku"
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "1password"
cask "adoptopenjdk"
cask "anaconda"
cask "arduino"
cask "arq"
cask "chromium"
cask "cloudflare-warp"
cask "dropbox"
cask "duet"
cask "gnucash"
cask "google-drive"
cask "ipfs"
cask "karabiner-elements"
cask "keybase"
cask "linear-linear"
cask "logitech-unifying"
cask "mactex"
cask "mullvadvpn"
cask "ngrok"
cask "pgadmin4"
cask "r"
cask "skype"
cask "steam"
cask "sublime-text"
cask "trader-workstation"
cask "vagrant"
cask "wireshark"
cask "xquartz"
cask "zoom"
mas "Be Focused Pro", id: 961632517
mas "BlueSee", id: 1336679524
mas "Brother iPrint&Scan", id: 1193539993
mas "Daily", id: 686910553
mas "Gapplin", id: 768053424
mas "GoodNotes", id: 1444383602
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LG Screen Manager", id: 1142051783
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ScreenBrush", id: 1233965871
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835
