tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "cocoapods"
brew "git"
brew "ios-deploy"
brew "mas"
brew "mono"
brew "mysql"
brew "node"
brew "python"
brew "python@2"
brew "react-native-cli"
brew "ruby"
brew "watchman"
brew "yarn"
cask "anaconda"
cask "arduino"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "freecad"
cask "fritzing"
cask "geekbench"
cask "gnucash"
cask "google-chrome"
cask "google-cloud-sdk"
cask "karabiner-elements"
cask "macdown"
cask "ngrok"
cask "nordvpn"
cask "openra"
cask "postman"
cask "sizeup"
cask "sketch"
cask "skype"
cask "sourcetree"
cask "steam"
cask "sublime-text"
cask "tripmode"
cask "vagrant"
cask "visual-studio-code"
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
